In [1]:
import pandas as pd

In [3]:
import pandas as pd

df1 = pd.DataFrame({
    "Emp_ID": [1, 2, 3],
    "Name": ["Ali", "Sara", "Ahmed"],
    "Salary": [40000, 45000, 42000]
})

df2 = pd.DataFrame({
    "Emp_ID": [4, 5],
    "Name": ["Ayesha", "Usman"],
    "Salary": [48000, 46000]
})

In [4]:
df1

   Emp_ID   Name  Salary
0       1    Ali   40000
1       2   Sara   45000
2       3  Ahmed   42000

In [5]:
df2

   Emp_ID    Name  Salary
0       4  Ayesha   48000
1       5   Usman   46000

In [6]:
pd.concat([df1,df2])

   Emp_ID    Name  Salary
0       1     Ali   40000
1       2    Sara   45000
2       3   Ahmed   42000
0       4  Ayesha   48000
1       5   Usman   46000

In [7]:
pd.concat([df1,df2],ignore_index=True)

   Emp_ID    Name  Salary
0       1     Ali   40000
1       2    Sara   45000
2       3   Ahmed   42000
3       4  Ayesha   48000
4       5   Usman   46000

In [9]:
pd.concat([df1,df2],axis=1)

   Emp_ID   Name  Salary  Emp_ID    Name   Salary
0       1    Ali   40000     4.0  Ayesha  48000.0
1       2   Sara   45000     5.0   Usman  46000.0
2       3  Ahmed   42000     NaN     NaN      NaN